#Задание А
def chert():
    n=int(input("Введите число "))
    print("-"*n)
chert()
#Задание Б
def perenos():
    str=input("Введите что нибудь ")
    for i in str:
        print(i)
perenos()
#Задание С
